RT-Thread/rt-thread/bsp/cypress/libraries/IFX_PSOC6_HAL/mtb-hal-cat1/include/cyhal_dma.h
/** Enable the DMA transfer so that it can start transferring data when triggered. A trigger is
 * caused either by calling \ref cyhal_dma_start_transfer or by hardware as a result of a connection
 * made in either \ref cyhal_dma_connect_digital or \ref cyhal_dma_init_adv. The DMA can be disabled
 * by calling \ref cyhal_dma_disable or by setting the \ref cyhal_dma_cfg_t action to \ref
 * CYHAL_DMA_TRANSFER_BURST_DISABLE, or \ref CYHAL_DMA_TRANSFER_FULL_DISABLE.
 *
 * @param[in] obj    The DMA object
 * @return The status of the enable request
 */
cy_rslt_t cyhal_dma_enable(cyhal_dma_t *obj);

/** Disable the DMA transfer so that it does not continue to trigger. It can be reenabled by calling
 * \ref cyhal_dma_enable or \ref cyhal_dma_configure.
 *
 * @param[in] obj    The DMA object
 * @return The status of the enable request
 */
cy_rslt_t cyhal_dma_disable(cyhal_dma_t *obj);

/** Initiates DMA channel transfer for specified DMA object. This should only be done after the
 * channel has been configured (\ref cyhal_dma_configure) and any necessary event callbacks setup
 * (\ref cyhal_dma_register_callback \ref cyhal_dma_enable_event)
 *
 * @param[in] obj    The DMA object
 * @return The status of the start_transfer request
 */
cy_rslt_t cyhal_dma_start_transfer(cyhal_dma_t *obj);

/** Checks if the transfer has been triggered, but not yet complete (eg: is pending, blocked or running)
 *
 * @param[in] obj    The DMA object
 * @return True if DMA channel is busy
 */
bool cyhal_dma_is_busy(cyhal_dma_t *obj);

/** Register a DMA callback handler.
 *
 * This function will be called when one of the events enabled by \ref cyhal_dma_enable_event occurs.
 *
 * @param[in] obj          The DMA object
 * @param[in] callback     The callback handler which will be invoked when an event triggers
 * @param[in] callback_arg Generic argument that will be provided to the callback when called
 */
void cyhal_dma_register_callback(cyhal_dma_t *obj, cyhal_dma_event_callback_t callback, void *callback_arg);

/** Configure DMA event enablement.
 *
 * When an enabled event occurs, the function specified by \ref cyhal_dma_register_callback will be called.
 *
 * @param[in] obj            The DMA object
 * @param[in] event          The DMA event type
 * @param[in] intr_priority  The priority for NVIC interrupt events. The priority from the most
 * recent call will take precedence, i.e all events will have the same priority.
 * @param[in] enable         True to turn on interrupts, False to turn off
 */
void cyhal_dma_enable_event(cyhal_dma_t *obj, cyhal_dma_event_t event, uint8_t intr_priority, bool enable);

/** Connects a source signal and enables the specified input to the DMA channel. This connection
 * can also be setup automatically on initialization via \ref cyhal_dma_init_adv. If the signal
 * needs to be disconnected later, \ref cyhal_dma_disconnect_digital can be used.
 *
 * @param[in] obj         The DMA object
 * @param[in] source      Source signal obtained from another driver's cyhal_<PERIPH>_enable_output
 * @param[in] input       Which input to enable
 * @return The status of the connection
 */
cy_rslt_t cyhal_dma_connect_digital(cyhal_dma_t *obj, cyhal_source_t source, cyhal_dma_input_t input);

/** Enables the specified output signal from a DMA channel that is triggered when a transfer is
 * completed. This can also be setup automatically on initialization via \ref cyhal_dma_init_adv.
 * If the output is not needed in the future, \ref cyhal_dma_disable_output can be used.
 *
 * @param[in]  obj         The DMA object
 * @param[in]  output      Which event triggers the output
 * @param[out] source      Pointer to user-allocated source signal object which
 * will be initialized by enable_output. \p source should be passed to
 * (dis)connect_digital functions to (dis)connect the associated endpoints.
 * @return The status of the output enable
 */
cy_rslt_t cyhal_dma_enable_output(cyhal_dma_t *obj, cyhal_dma_output_t output, cyhal_source_t *source);

/** Disconnects a source signal and disables the specified input to the DMA channel. This removes
 * the connection that was established by either \ref cyhal_dma_init_adv or \ref
 * cyhal_dma_connect_digital.
 *
 * @param[in] obj         The DMA object
 * @param[in] source      Source signal from cyhal_<PERIPH>_enable_output to disable
 * @param[in] input       Which input to disable
 * @return The status of the disconnect
 */
cy_rslt_t cyhal_dma_disconnect_digital(cyhal_dma_t *obj, cyhal_source_t source, cyhal_dma_input_t input);

/** Disables the specified output signal from a DMA channel. This turns off the signal that was
 * enabled by either \ref cyhal_dma_init_adv or \ref cyhal_dma_enable_output. It is recommended
 * that the signal is disconnected (cyhal_<PERIPH>_disconnect_digital) from anything it might be
 * driving before being disabled.
 *
 * @param[in]  obj         The DMA object
 * @param[in]  output      Which output to disable
 * @return The status of the disablement
 * */
cy_rslt_t cyhal_dma_disable_output(cyhal_dma_t *obj, cyhal_dma_output_t output);

#if defined(__cplusplus)
}
#endif

#ifdef CYHAL_DMA_IMPL_HEADER
#include CYHAL_DMA_IMPL_HEADER
#endif /* CYHAL_DMA_IMPL_HEADER */

/** \} group_hal_dma */
